app/Controllers/Latihan.php

    public function menampilkan_view()
    {
        echo "Daftar Mahasiswa";
        echo "<br><br>";
        $data['mahasiswa'] = $this->latihanmodel->findAll();
---
SELECT *
FROM `tbl_mahasiswa`